app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def authorize
    if request.format == Mime[:html]
      unless User.find_by(id: session[:user_id])