app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-01-06 16:59:08.787269"], ["updated_at", "2021-01-06 16:59:08.787269"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 1], ["created_at", "2021-01-06 16:59:09.027619"], ["updated_at", "2021-01-06 16:59:09.027619"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 4], ["updated_at", "2021-01-06 17:43:44.099801"], ["id", 4]]