app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sdf"], ["address", "dfsdfsdf"], ["email", "sdfsdf@gmail.com"], ["pay_type", 0], ["created_at", "2021-01-08 05:26:35.079069"], ["updated_at", "2021-01-08 05:26:35.079069"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]

  def ensure_cart_isnt_empty
    if @cart.line_items.empty?
---
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 15], ["LIMIT", 1]]