app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY "users"."name" ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Aranya"], ["password_digest", "$2a$12$QQ9sR4S7.aMlgkV/HrdfhOn/.eKYjA7oZNOjNj9ibVqORwDIYNiMG"], ["created_at", "2021-01-08 12:23:50.813981"], ["updated_at", "2021-01-08 12:23:50.813981"]]